# pandas.DataFrame.fillna

In [1]:
from pandas import *
from numpy import *

In [2]:
x=[1,2,nan,4,nan]
y=[6,nan,8,9,nan]
data=DataFrame([[1,2,nan,4,nan],
                [6,nan,8,9,nan],
                [2,nan,4,nan,nan],
                [6,5,nan,2,nan]],
                columns=list("ABCDE"))

# My Data Have Null Values

In [3]:
data

   A    B    C    D   E
0  1  2.0  NaN  4.0 NaN
1  6  NaN  8.0  9.0 NaN
2  2  NaN  4.0  NaN NaN
3  6  5.0  NaN  2.0 NaN

# So we Use fillna To Fill Values instead of NAN

# IF inplace=False 
### The Base Data Not Change

In [4]:
data.fillna(4444,inplace=False) ## '4444' is my value That I want To Fill

   A       B       C       D       E
0  1     2.0  4444.0     4.0  4444.0
1  6  4444.0     8.0     9.0  4444.0
2  2  4444.0     4.0  4444.0  4444.0
3  6     5.0  4444.0     2.0  4444.0

In [5]:
#BASE DATA NOT CHANGED
data

   A    B    C    D   E
0  1  2.0  NaN  4.0 NaN
1  6  NaN  8.0  9.0 NaN
2  2  NaN  4.0  NaN NaN
3  6  5.0  NaN  2.0 NaN

# Else inplace=True
### The Base Data Will Changed

In [6]:
data.fillna(4444,inplace=True) ## '4444' is my value That I want To Fill

In [7]:
#BASE DATA CHANGED
data

   A       B       C       D       E
0  1     2.0  4444.0     4.0  4444.0
1  6  4444.0     8.0     9.0  4444.0
2  2  4444.0     4.0  4444.0  4444.0
3  6     5.0  4444.0     2.0  4444.0

# THANK YOU FOR ASKING